// 001_TEST1.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
// 솔루션 "Homework" > 프로젝트 001_TEST1 >  소스 파일 "여기에서 코딩함"  
// 프로젝트 완전 삭제는 폴더를 지워야 함. 프로젝트만 삭제하면 다시 불러오기 가능. (솔루션 우클릭 > 추가 > 기존 프로젝트) **
// 새 프로젝트 생성시 "ㅁ솔루션 아래 같은 디렉토리 체크 반드시 해제할것" !!
// 한 솔루션(Homework) > 여러개의 프로젝트(TEST1-3) = 응용프로그램
// 좌측 하단의 "솔루션 탐색기/속성 관리자/깃 변경 내용" -> 보기 탭에서 불러오면 됨 !!
// 이 화면 상단에서 "001_TEST1".. 프로젝트 파일 창 지워버렸다면, ** 처럼 똑같이 불러내면 됨 !!
// "깃 변경 내용" 에서 실시간으로 변경되는 내용 열람 가능 // 커밋과 푸쉬도 이 곳에서 함. 
// 하단의 출력 보기 선택: 디버그로 설정해두기. 

#include <iostream>

int main()
{
    std::cout << "Hello World! 첫번째 프로젝트\n";
    return 0;
}
// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.